Revit 2024 API
Application.AllowNavigationDuringRedraw Property
 Checks whether or not the navigation during redraw is enabled, and enable or disable it.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public bool AllowNavigationDuringRedraw { get; set; }
Visual Basic
Public Property AllowNavigationDuringRedraw As Boolean
	Get
	Set
Visual C++
public:
property bool AllowNavigationDuringRedraw {
	bool get ();
	void set (bool value);
}
See Also
Application Class
Autodesk.Revit.ApplicationServices Namespace